name: "layoutlmv3"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [-1, -1]
  },
  {
    name: "bbox"
    data_type: TYPE_INT64
    dims: [-1, -1, 4]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [-1, -1]
  },
  {
    name: "pixel_values"
    data_type: TYPE_FP32
    dims: [-1, 3, 224, 224]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [-1, -1, 7]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]